#+TITLE: Examples
#+OPTIONS: toc:nil num:nil
#+PROPERTY: header-args :exports both
#+PROPERTY: header-args :noweb yes
#+PROPERTY: header-args:shell :results output :shebang "#!/usr/bin/env bash" :prologue "set -euo pipefail" :dir ../../../
#+PROPERTY: header-args:cpp :results output :flags (mapconcat #'identity (append (process-lines "pkg-config" "--cflags" "octra") (process-lines "pkg-config" "--libs" "octra")) " ")
#+PROPERTY: header-args:javascript :dir ../../../ :session none
#+PROPERTY: header-args:php :dir ../../../

** Sanity (executed)

#+begin_src emacs-lisp :results value
(+ 40 2)
#+end_src

#+RESULTS:
: 42

#+begin_src shell
echo "Org Babel is executing blocks."
#+end_src

#+RESULTS:
: Org Babel is executing blocks.

